# Практическое задание по уроку "Базовые структуры данных"
# a = 23891471923807487.142352314353455
# b = 23891471923807487.142352314356734
# c = 23891471923843245.142352314334563
# d = 23891471923843245.142352314334553
# print(a + c > b + d)

# Практическое задание по уроку "Строки и индексация строк"
# name1, name2 = 'это моя строка', 'это новая строка'
# print(name1[0])
# print(name1[-1])
# print(name1[2:5])
# print(name1[::-1])
# print(len(name1))
# print(name2 + ' ' + name1)

# Практическое задание по теме "Переменные."
num1, num2 = 5, 3
sum = num1 + num2
print(sum)
result = sum + num1 * num2
print(result)

